Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# RecordingCodec.UnknownError
source: Unknown error
de: Unbekannter Fehler
ja: 不明なエラー
pt_br: Erro desconhecido
ru: Неизвестная ошибка
zh_hans: 未知错误

# RemoteCommand.AutopopulationTitleCheckTerminalState
source: Provide Terminal State Automatically
de: Terminalstatus automatisch bereitstellen
ja: ターミナルの状態を自動的に提供
pt_br: Fornecer o estado do terminal automaticamente
ru: Автоматически предоставлять состояние терминала
zh_hans: 自动提供终端状态

# RemoteCommand.AutopopulationTitleViewContents
source: Provide Screen Contents Automatically
de: Bildschirminhalt automatisch bereitstellen
ja: 画面の内容を自動的に提供
pt_br: Fornecer o conteúdo da tela automaticamente
ru: Автоматически предоставлять содержимое экрана
zh_hans: 自动提供屏幕内容

# RemoteCommand.AutopopulationWarningCheckTerminalState
source: By setting this permission to “Always Allow”, terminal state will be sent automatically on every message you send in this chat. This includes: • The current or last command and its exit status •The window size • Your shell • The current working directory, username, and hostname.
de: Wenn Sie diese Berechtigung auf „Immer erlauben“ setzen, wird der Terminalstatus bei jeder Nachricht, die Sie in diesem Chat senden, automatisch übermittelt. Dazu gehören: • Der aktuelle oder letzte Befehl und sein Exit-Status • Die Fenstergröße • Ihre Shell • Das aktuelle Arbeitsverzeichnis, der Benutzername und der Hostname.
ja: この権限を「常に許可」に設定すると、このチャットでメッセージを送信するたびに、ターミナルの状態が自動的に送信されます。 これには以下が含まれます: • 現在または直前のコマンドとその終了ステータス • ウィンドウサイズ • 使用しているシェル • 現在の作業ディレクトリ、ユーザー名、ホスト名
pt_br: Ao definir esta permissão como “Sempre permitir”, o estado do terminal será enviado automaticamente em cada mensagem que você enviar neste chat. Isto inclui: • O comando atual ou o último e seu status de saída • O tamanho da janela • Seu shell • O diretório de trabalho atual, o nome de usuário e o nome do host.
ru: Если установить для этого разрешения значение «Всегда разрешать», состояние терминала будет автоматически отправляться при каждом сообщении, которое вы отправляете в этом чате. Сюда входит: • Текущая или последняя команда и её код завершения • Размер окна • Ваша оболочка • Текущий рабочий каталог, имя пользователя и имя хоста.
zh_hans: 将此权限设置为“始终允许”后，终端状态会在你在此聊天中发送的每条消息上自动发送。 这包括： • 当前或上一条命令及其退出状态 • 窗口大小 • 你的 Shell • 当前工作目录、用户名和主机名。

# RemoteCommand.AutopopulationWarningViewContents
source: By setting this permission to “Always Allow”, the current visible screen of your terminal session will be sent automatically on every message you send in this chat.
de: Wenn Sie diese Berechtigung auf „Immer erlauben“ setzen, wird der aktuell sichtbare Bildschirm Ihrer Terminal-Sitzung bei jeder Nachricht, die Sie in diesem Chat senden, automatisch übermittelt.
ja: この権限を「常に許可」に設定すると、このチャットでメッセージを送信するたびに、ターミナルセッションの現在表示されている画面が自動的に送信されます。
pt_br: Ao definir esta permissão como “Sempre permitir”, a tela atualmente visível da sua sessão de terminal será enviada automaticamente em cada mensagem que você enviar neste chat.
ru: Если установить для этого разрешения значение «Всегда разрешать», видимое содержимое экрана вашего сеанса терминала будет автоматически отправляться при каждом сообщении, которое вы отправляете в этом чате.
zh_hans: 将此权限设置为“始终允许”后，终端会话的当前可见屏幕会在你在此聊天中发送的每条消息上自动发送。

# RemoteCommand.MarkdownCreateFile
source: Creating %@
de: %@ wird erstellt
ja: %@ を作成中
pt_br: Criando %@
ru: Создание %@
zh_hans: 创建 %@

# RemoteCommand.MarkdownDeleteCurrentLine
source: Erasing the current command line
de: Aktuelle Befehlszeile wird gelöscht
ja: 現在のコマンドラインを消去中
pt_br: Apagando a linha de comando atual
ru: Стирание текущей командной строки
zh_hans: 清除当前命令行

# RemoteCommand.MarkdownDetectSSHSession
source: Checking if you are using SSH
de: Es wird geprüft, ob Sie SSH verwenden
ja: SSH を使用しているか確認中
pt_br: Verificando se você está usando SSH
ru: Проверка использования SSH
zh_hans: 检查是否使用SSH

# RemoteCommand.MarkdownExecuteCommand
source: Executing `%@`
de: `%@` wird ausgeführt
ja: `%@` を実行中
pt_br: Executando `%@`
ru: Выполнение `%@`
zh_hans: 执行 `%@`

# RemoteCommand.MarkdownGetCommandBeforeCursor
source: Reading your current command prompt
de: Ihre aktuelle Befehlszeile wird gelesen
ja: 現在のコマンドプロンプトを読み取り中
pt_br: Lendo seu prompt de comando atual
ru: Чтение текущей командной строки
zh_hans: 阅读当前命令提示符

# RemoteCommand.MarkdownGetCommandHistory
source: Reviewing the history of commands you have run in this session
de: Der Verlauf der in dieser Sitzung ausgeführten Befehle wird durchgesehen
ja: このセッションで実行したコマンドの履歴を確認中
pt_br: Revisando o histórico de comandos que você executou nesta sessão
ru: Просмотр истории команд, выполненных в этом сеансе
zh_hans: 查看本次会话中已执行的命令历史记录

# RemoteCommand.MarkdownGetCommandOutput
source: Fetching the output of a previously run command
de: Die Ausgabe eines zuvor ausgeführten Befehls wird abgerufen
ja: 以前に実行したコマンドの出力を取得中
pt_br: Obtendo a saída de um comando executado anteriormente
ru: Получение вывода ранее выполненной команды
zh_hans: 获取之前执行命令的输出结果

# RemoteCommand.MarkdownGetCurrentDirectory
source: Discovering your current directory
de: Ihr aktuelles Verzeichnis wird ermittelt
ja: 現在のディレクトリを確認中
pt_br: Descobrindo seu diretório atual
ru: Определение текущего каталога
zh_hans: 发现当前目录内容

# RemoteCommand.MarkdownGetLastCommand
source: Viewing the last command you ran in this session
de: Der letzte in dieser Sitzung ausgeführte Befehl wird angezeigt
ja: このセッションで最後に実行したコマンドを表示中
pt_br: Visualizando o último comando que você executou nesta sessão
ru: Просмотр последней команды, выполненной в этом сеансе
zh_hans: 查看本次会话中最后执行的命令

# RemoteCommand.MarkdownGetLastExitStatus
source: Checking the exit status of the last command
de: Der Exit-Status des letzten Befehls wird geprüft
ja: 最後のコマンドの終了ステータスを確認中
pt_br: Verificando o status de saída do último comando
ru: Проверка кода завершения последней команды
zh_hans: 检查上一个命令的退出状态

# RemoteCommand.MarkdownGetManPage
source: Checking the manpage for `%@`
de: Die Manpage für `%@` wird geprüft
ja: `%@` の manpage を確認中
pt_br: Verificando a manpage de `%@`
ru: Просмотр справочной страницы для `%@`
zh_hans: 查看 `%@` 的手册页说明

# RemoteCommand.MarkdownGetRemoteHostname
source: Getting the current host name of this terminal session
de: Der aktuelle Hostname dieser Terminal-Sitzung wird ermittelt
ja: このターミナルセッションの現在のホスト名を取得中
pt_br: Obtendo o nome do host atual desta sessão de terminal
ru: Получение имени хоста для этого сеанса терминала
zh_hans: 获取当前终端会话的主机名

# RemoteCommand.MarkdownGetScreenContents
source: Reading the visible screen
de: Der sichtbare Bildschirm wird gelesen
ja: 表示中の画面を読み取り中
pt_br: Lendo a tela visível
ru: Чтение видимого содержимого экрана
zh_hans: 读取可见屏幕内容

# RemoteCommand.MarkdownGetShellType
source: Determining which shell you use
de: Es wird ermittelt, welche Shell Sie verwenden
ja: 使用しているシェルを確認中
pt_br: Determinando qual shell você usa
ru: Определение используемой оболочки
zh_hans: 确定使用的shell类型

# RemoteCommand.MarkdownGetTerminalSize
source: Querying the size of your terminal window
de: Die Größe Ihres Terminalfensters wird abgefragt
ja: ターミナルウィンドウのサイズを確認中
pt_br: Consultando o tamanho da janela do terminal
ru: Запрос размера окна терминала
zh_hans: 查询终端窗口的大小

# RemoteCommand.MarkdownGetURL
source: Get the current URL
de: Aktuelle URL wird abgerufen
ja: 現在の URL を取得
pt_br: Obter a URL atual
ru: Получение текущего URL
zh_hans: 获取当前URL

# RemoteCommand.MarkdownGetUserIdentity
source: Checking your username
de: Ihr Benutzername wird geprüft
ja: ユーザー名を確認中
pt_br: Verificando seu nome de usuário
ru: Проверка имени пользователя
zh_hans: 检查您的用户名

# RemoteCommand.MarkdownInsertTextAtCursor
source: Typing `%@` into the current session
de: `%@` wird in die aktuelle Sitzung eingegeben
ja: 現在のセッションに `%@` を入力中
pt_br: Digitando `%@` na sessão atual
ru: Ввод `%@` в текущий сеанс
zh_hans: 在当前会话中输入 `%@`

# RemoteCommand.MarkdownIsAtPrompt
source: Checking if you’re at a shell prompt
de: Es wird geprüft, ob Sie sich an einer Shell-Eingabeaufforderung befinden
ja: シェルプロンプトにいるか確認中
pt_br: Verificando se você está em um prompt de shell
ru: Проверка нахождения в приглашении оболочки
zh_hans: 检查是否处于shell提示符状态

# RemoteCommand.MarkdownLoadURL
source: Navigate to %@
de: Zu %@ navigieren
ja: %@ に移動
pt_br: Navegar para %@
ru: Переход по адресу %@
zh_hans: 导航至 %@

# RemoteCommand.MarkdownReadWebPage
source: View the current web page
de: Aktuelle Webseite anzeigen
ja: 現在の Web ページを表示
pt_br: Visualizar a página da web atual
ru: Просмотр текущей веб-страницы
zh_hans: 查看当前网页

# RemoteCommand.MarkdownRestartSession
source: Restarting this session
de: Diese Sitzung wird neu gestartet
ja: このセッションを再起動中
pt_br: Reiniciando esta sessão
ru: Перезапуск этого сеанса
zh_hans: 重启此会话

# RemoteCommand.MarkdownSearchBrowser
source: Search in browser for %@
de: Im Browser nach %@ suchen
ja: ブラウザで %@ を検索
pt_br: Buscar no navegador por %@
ru: Поиск в браузере: %@
zh_hans: 在浏览器中搜索 %@

# RemoteCommand.MarkdownSearchCommandHistory
source: Searching the history of commands you have run in this session
de: Der Verlauf der in dieser Sitzung ausgeführten Befehle wird durchsucht
ja: このセッションで実行したコマンドの履歴を検索中
pt_br: Buscando no histórico de comandos que você executou nesta sessão
ru: Поиск в истории команд, выполненных в этом сеансе
zh_hans: 查询此会话中执行的命令历史记录

# RemoteCommand.MarkdownSetClipboard
source: Pasting to the clipboard
de: In die Zwischenablage wird eingefügt
ja: クリップボードに貼り付け中
pt_br: Colando na área de transferência
ru: Вставка в буфер обмена
zh_hans: 将内容粘贴到剪贴板中

# RemoteCommand.MarkdownWebSearch
source: Search the web for “%@”
de: Im Web nach „%@“ suchen
ja: Web で「%@」を検索
pt_br: Buscar na web por “%@”
ru: Поиск в интернете «%@»
zh_hans: 在网页上搜索“%@”

# RemoteCommand.PermissionCreateFile
source: The AI Agent would like to create a file named `%@`
de: Der KI-Agent möchte eine Datei namens `%@` erstellen
ja: AI エージェントが `%@` という名前のファイルを作成しようとしています
pt_br: O agente de IA gostaria de criar um arquivo chamado `%@`
ru: ИИ-агент хочет создать файл с именем `%@`
zh_hans: AI 代理希望创建名为 `%@` 的文件

# RemoteCommand.PermissionDeleteCurrentLine
source: The AI Agent would like to erase the current command line
de: Der KI-Agent möchte die aktuelle Befehlszeile löschen
ja: AI エージェントが現在のコマンドラインを消去しようとしています
pt_br: O agente de IA gostaria de apagar a linha de comando atual
ru: ИИ-агент хочет стереть текущую командную строку
zh_hans: AI代理希望清除当前命令行

# RemoteCommand.PermissionDetectSSHSession
source: The AI Agent would like to check if you are using SSH
de: Der KI-Agent möchte prüfen, ob Sie SSH verwenden
ja: AI エージェントが SSH を使用しているか確認しようとしています
pt_br: O agente de IA gostaria de verificar se você está usando SSH
ru: ИИ-агент хочет проверить, используете ли вы SSH
zh_hans: AI代理希望检查您是否使用SSH

# RemoteCommand.PermissionExecuteCommand
source: The AI Agent would like to execute `%@`
de: Der KI-Agent möchte `%@` ausführen
ja: AI エージェントが `%@` を実行しようとしています
pt_br: O agente de IA gostaria de executar `%@`
ru: ИИ-агент хочет выполнить `%@`
zh_hans: AI 代理希望执行 `%@`

# RemoteCommand.PermissionGetCommandBeforeCursor
source: The AI Agent would like to read your current command prompt
de: Der KI-Agent möchte Ihre aktuelle Befehlszeile lesen
ja: AI エージェントが現在のコマンドプロンプトを読み取ろうとしています
pt_br: O agente de IA gostaria de ler seu prompt de comando atual
ru: ИИ-агент хочет прочитать текущую командную строку
zh_hans: AI代理希望读取您当前的命令提示符

# RemoteCommand.PermissionGetCommandHistory
source: The AI Agent would like to review the history of commands you have run in this session
de: Der KI-Agent möchte den Verlauf der in dieser Sitzung ausgeführten Befehle einsehen
ja: AI エージェントがこのセッションで実行したコマンドの履歴を確認しようとしています
pt_br: O agente de IA gostaria de revisar o histórico de comandos que você executou nesta sessão
ru: ИИ-агент хочет просмотреть историю команд, выполненных в этом сеансе
zh_hans: AI代理希望查看此会话中您运行的命令历史记录

# RemoteCommand.PermissionGetCommandOutput
source: The AI Agent would like to fetch the output of a previously run command
de: Der KI-Agent möchte die Ausgabe eines zuvor ausgeführten Befehls abrufen
ja: AI エージェントが以前に実行したコマンドの出力を取得しようとしています
pt_br: O agente de IA gostaria de obter a saída de um comando executado anteriormente
ru: ИИ-агент хочет получить вывод ранее выполненной команды
zh_hans: AI代理希望获取之前执行的命令输出结果

# RemoteCommand.PermissionGetCurrentDirectory
source: The AI Agent would like to know your current directory
de: Der KI-Agent möchte Ihr aktuelles Verzeichnis wissen
ja: AI エージェントが現在のディレクトリを確認しようとしています
pt_br: O agente de IA gostaria de saber seu diretório atual
ru: ИИ-агент хочет узнать ваш текущий каталог
zh_hans: AI代理希望了解您当前的目录

# RemoteCommand.PermissionGetLastCommand
source: The AI Agent would like to view the last command you ran in this session
de: Der KI-Agent möchte den letzten in dieser Sitzung ausgeführten Befehl ansehen
ja: AI エージェントがこのセッションで最後に実行したコマンドを表示しようとしています
pt_br: O agente de IA gostaria de visualizar o último comando que você executou nesta sessão
ru: ИИ-агент хочет просмотреть последнюю команду, выполненную в этом сеансе
zh_hans: 该 AI 代理希望查看此会话中您执行的最后一条命令

# RemoteCommand.PermissionGetLastExitStatus
source: The AI Agent would like to check the exit status of the last command
de: Der KI-Agent möchte den Exit-Status des letzten Befehls prüfen
ja: AI エージェントが最後のコマンドの終了ステータスを確認しようとしています
pt_br: O agente de IA gostaria de verificar o status de saída do último comando
ru: ИИ-агент хочет проверить код завершения последней команды
zh_hans: 该 AI 代理希望检查最后一条命令的退出状态

# RemoteCommand.PermissionGetManPage
source: The AI Agent would like to check the manpage for `%@`
de: Der KI-Agent möchte die Manpage für `%@` prüfen
ja: AI エージェントが `%@` の manpage を確認しようとしています
pt_br: O agente de IA gostaria de verificar a manpage de `%@`
ru: ИИ-агент хочет просмотреть справочную страницу для `%@`
zh_hans: AI 代理希望查看 `%@` 的手册页说明

# RemoteCommand.PermissionGetRemoteHostname
source: The AI Agent would like to get the current host name of this terminal session
de: Der KI-Agent möchte den aktuellen Hostnamen dieser Terminal-Sitzung abrufen
ja: AI エージェントがこのターミナルセッションの現在のホスト名を取得しようとしています
pt_br: O agente de IA gostaria de obter o nome do host atual desta sessão de terminal
ru: ИИ-агент хочет получить имя хоста этого сеанса терминала
zh_hans: 该 AI 代理希望获取此终端会话的当前主机名

# RemoteCommand.PermissionGetScreenContents
source: The AI Agent would like to read the visible screen of your terminal session
de: Der KI-Agent möchte den sichtbaren Bildschirm Ihrer Terminal-Sitzung lesen
ja: AI エージェントがターミナルセッションの表示中の画面を読み取ろうとしています
pt_br: O agente de IA gostaria de ler a tela visível da sua sessão de terminal
ru: ИИ-агент хочет прочитать видимое содержимое экрана вашего сеанса терминала
zh_hans: 该 AI 代理希望读取您终端会话的可见屏幕内容

# RemoteCommand.PermissionGetShellType
source: The AI Agent would like to determine which shell you use
de: Der KI-Agent möchte ermitteln, welche Shell Sie verwenden
ja: AI エージェントが使用しているシェルを確認しようとしています
pt_br: O agente de IA gostaria de determinar qual shell você usa
ru: ИИ-агент хочет определить, какую оболочку вы используете
zh_hans: AI Agent 想要确定您使用的 shell

# RemoteCommand.PermissionGetTerminalSize
source: The AI Agent would like to query the size of your terminal window
de: Der KI-Agent möchte die Größe Ihres Terminalfensters abfragen
ja: AI エージェントがターミナルウィンドウのサイズを確認しようとしています
pt_br: O agente de IA gostaria de consultar o tamanho da janela do terminal
ru: ИИ-агент хочет запросить размер окна терминала
zh_hans: AI Agent 想要查询您的终端窗口大小

# RemoteCommand.PermissionGetURL
source: The AI agent would like to write to get the current URL
de: Der KI-Agent möchte die aktuelle URL abrufen
ja: AI エージェントが現在の URL を取得しようとしています
pt_br: O agente de IA gostaria de obter a URL atual
ru: ИИ-агент хочет получить текущий URL
zh_hans: AI agent 想要获取当前 URL

# RemoteCommand.PermissionGetUserIdentity
source: The AI Agent would like to check your username
de: Der KI-Agent möchte Ihren Benutzernamen prüfen
ja: AI エージェントがユーザー名を確認しようとしています
pt_br: O agente de IA gostaria de verificar seu nome de usuário
ru: ИИ-агент хочет проверить ваше имя пользователя
zh_hans: AI Agent 想要检查您的用户名

# RemoteCommand.PermissionInsertTextAtCursor
source: The AI Agent would like to type `%@` into the current session
de: Der KI-Agent möchte `%@` in die aktuelle Sitzung eingeben
ja: AI エージェントが現在のセッションに `%@` を入力しようとしています
pt_br: O agente de IA gostaria de digitar `%@` na sessão atual
ru: ИИ-агент хочет ввести `%@` в текущий сеанс
zh_hans: AI 代理想要在当前会话中输入 `%@`

# RemoteCommand.PermissionIsAtPrompt
source: The AI Agent would like to check if you’re at a shell prompt
de: Der KI-Agent möchte prüfen, ob Sie sich an einer Shell-Eingabeaufforderung befinden
ja: AI エージェントがシェルプロンプトにいるか確認しようとしています
pt_br: O agente de IA gostaria de verificar se você está em um prompt de shell
ru: ИИ-агент хочет проверить, находитесь ли вы в приглашении оболочки
zh_hans: AI代理希望检查您是否处于shell提示符下

# RemoteCommand.PermissionLoadURL
source: The AI agent would like to navigate to %@
de: Der KI-Agent möchte zu %@ navigieren
ja: AI エージェントが %@ に移動しようとしています
pt_br: O agente de IA gostaria de navegar para %@
ru: ИИ-агент хочет перейти по адресу %@
zh_hans: AI代理希望导航至 %@

# RemoteCommand.PermissionReadWebPage
source: The AI agent would like to write to view the current web page
de: Der KI-Agent möchte die aktuelle Webseite ansehen
ja: AI エージェントが現在の Web ページを表示しようとしています
pt_br: O agente de IA gostaria de visualizar a página da web atual
ru: ИИ-агент хочет просмотреть текущую веб-страницу
zh_hans: AI代理希望写入内容以查看当前网页

# RemoteCommand.PermissionRestartSession
source: The AI Agent would like to restart this session, which kills any running jobs
de: Der KI-Agent möchte diese Sitzung neu starten, wodurch alle laufenden Prozesse beendet werden
ja: AI エージェントがこのセッションを再起動しようとしています。実行中のジョブはすべて強制終了されます
pt_br: O agente de IA gostaria de reiniciar esta sessão, o que encerra quaisquer processos em execução
ru: ИИ-агент хочет перезапустить этот сеанс, что приведёт к завершению всех выполняющихся процессов
zh_hans: AI代理希望重启此会话，这将终止所有正在运行的任务

# RemoteCommand.PermissionSearchBrowser
source: The AI agent would like to search the current web page for “%@”
de: Der KI-Agent möchte die aktuelle Webseite nach „%@“ durchsuchen
ja: AI エージェントが現在の Web ページで「%@」を検索しようとしています
pt_br: O agente de IA gostaria de buscar “%@” na página da web atual
ru: ИИ-агент хочет выполнить поиск «%@» на текущей веб-странице
zh_hans: AI代理希望在当前网页中搜索“%@”

# RemoteCommand.PermissionSearchCommandHistory
source: The AI Agent would like to search the history of commands you have run in this session
de: Der KI-Agent möchte den Verlauf der in dieser Sitzung ausgeführten Befehle durchsuchen
ja: AI エージェントがこのセッションで実行したコマンドの履歴を検索しようとしています
pt_br: O agente de IA gostaria de buscar no histórico de comandos que você executou nesta sessão
ru: ИИ-агент хочет выполнить поиск в истории команд, выполненных в этом сеансе
zh_hans: 该 AI 代理希望查询您在此会话中执行的命令历史记录

# RemoteCommand.PermissionSetClipboard
source: The AI Agent would like to paste to the clipboard
de: Der KI-Agent möchte in die Zwischenablage einfügen
ja: AI エージェントがクリップボードに貼り付けようとしています
pt_br: O agente de IA gostaria de colar na área de transferência
ru: ИИ-агент хочет вставить данные в буфер обмена
zh_hans: 该 AI 代理希望将内容粘贴到剪贴板中

# RemoteCommand.PermissionTitleActInWebBrowser
source: AI can Act in Web Browser
de: KI kann im Webbrowser agieren
ja: AI が Web ブラウザで操作可能
pt_br: A IA pode agir no navegador da web
ru: ИИ может действовать в веб-браузере
zh_hans: AI 可在网页浏览器中操作

# RemoteCommand.PermissionTitleCheckTerminalState
source: AI can Check Terminal State
de: KI kann Terminalstatus prüfen
ja: AI がターミナルの状態を確認可能
pt_br: A IA pode verificar o estado do terminal
ru: ИИ может проверять состояние терминала
zh_hans: AI 可以检查终端状态

# RemoteCommand.PermissionTitleControlTerminal
source: AI can Control Terminal
de: KI kann Terminal steuern
ja: AI がターミナルを操作可能
pt_br: A IA pode controlar o terminal
ru: ИИ может управлять терминалом
zh_hans: AI 可以控制终端

# RemoteCommand.PermissionTitleRunCommands
source: AI can Run Commands
de: KI kann Befehle ausführen
ja: AI がコマンドを実行可能
pt_br: A IA pode executar comandos
ru: ИИ может выполнять команды
zh_hans: AI可以执行命令

# RemoteCommand.PermissionTitleViewContents
source: AI can View Contents
de: KI kann Inhalte anzeigen
ja: AI が内容を表示可能
pt_br: A IA pode ver o conteúdo
ru: ИИ может просматривать содержимое
zh_hans: AI可以查看文件内容

# RemoteCommand.PermissionTitleViewManpages
source: AI can View Manpages
de: KI kann Manpages anzeigen
ja: AI が manpage を表示可能
pt_br: A IA pode ver as páginas de manual
ru: ИИ может просматривать справочные страницы
zh_hans: AI可以查看使用说明文档

# RemoteCommand.PermissionTitleWriteToClipboard
source: AI can Write to the Clipboard
de: KI kann in die Zwischenablage schreiben
ja: AI がクリップボードに書き込み可能
pt_br: A IA pode escrever na área de transferência
ru: ИИ может записывать в буфер обмена
zh_hans: AI可以将内容写入剪贴板

# RemoteCommand.PermissionTitleWriteToFilesystem
source: AI can Write to the File System
de: KI kann in das Dateisystem schreiben
ja: AI がファイルシステムに書き込み可能
pt_br: A IA pode escrever no sistema de arquivos
ru: ИИ может записывать в файловую систему
zh_hans: AI可以将内容写入文件系统

# RemoteCommand.PermissionWebSearch
source: The AI agent would like to write to search the web for “%@”
de: Der KI-Agent möchte im Web nach „%@“ suchen
ja: AI エージェントが Web で「%@」を検索しようとしています
pt_br: O agente de IA gostaria de buscar “%@” na web
ru: ИИ-агент хочет выполнить поиск в интернете «%@»
zh_hans: AI代理希望通过网络搜索“%@”相关内容。

# RemotePreferences.CannotCopyToURL
source: Settings cannot be copied to a URL.
de: Einstellungen können nicht zu einer URL kopiert werden.
ja: 設定を URL にコピーすることはできません。
pt_br: Não é possível copiar os ajustes para uma URL.
ru: Настройки нельзя скопировать по URL.
zh_hans: 设置无法拷贝到 URL。

# RemotePreferences.CannotCopyToURLDetail
source: To make it available, first quit iTerm2 and then manually copy ~/Library/Preferences/com.googlecode.iterm2.plist to your hosting provider.
de: Um sie verfügbar zu machen, beenden Sie zuerst iTerm2 und kopieren Sie dann ~/Library/Preferences/com.googlecode.iterm2.plist manuell zu Ihrem Hosting-Anbieter.
ja: 利用可能にするには、まず iTerm2 を終了してから、~/Library/Preferences/com.googlecode.iterm2.plist を手動でホスティングプロバイダーにコピーしてください。
pt_br: Para torná-lo disponível, primeiro encerre o iTerm2 e depois copie manualmente ~/Library/Preferences/com.googlecode.iterm2.plist para o seu provedor de hospedagem.
ru: Чтобы сделать их доступными, сначала завершите работу iTerm2, а затем вручную скопируйте файл ~/Library/Preferences/com.googlecode.iterm2.plist на ваш хостинг.
zh_hans: 要使其可用，请先退出 iTerm2，然后手动将 ~/Library/Preferences/com.googlecode.iterm2.plist 拷贝到你的托管服务提供者。

# RemotePreferences.CopyDataFilesToFolderPrompt
source: Your snippets, notes, or icon customizations changed. Copy them to %@?
de: Ihre Schnipsel, Notizen oder Symbolanpassungen haben sich geändert. Sollen sie nach %@ kopiert werden?
ja: スニペット、メモ、アイコンのカスタマイズが変更されました。%@ にコピーしますか？
pt_br: Seus Fragmentos, notas ou personalizações de ícone foram alterados. Copiá-los para %@?
ru: Ваши сниппеты, заметки или настройки значков изменились. Скопировать их в %@?
zh_hans: 你的代码片段、笔记或图标自定义项已更改。将其拷贝到 %@？
